NSCameraUsageDescription = "ھۆججەتلەرنى سىكانىرلاش ھەمدە سۈرەت ۋە سىن ھاسىل قىلىش ئۈچۈن كامىرانى زىيارەت قىلىش تەلەپ قىلىنىدۇ.";
NSFaceIDUsageDescription = "چىراي پەرقلەندۈرۈش ئارقىلىق چىراي كىملىكى دەلىللەش تەلەپ قىلىنىدۇ.";
NSLocationAlwaysUsageDescription = "بۇ ئەپ سىز ئوخشىمىغان رايۇنلاردا يۆتكەلگەندە ئاپتۇماتىك ھۆججەت چىقىرىشنى قوزغىتىش ئۈچۈن ئورنىڭىزنى زىيارەت قىلىدۇ.";
NSPhotoLibraryUsageDescription = "رەسىم ۋە سىنلىرىڭىزنى بۇلۇتقا يوللاش ئۈچۈن رەسىم ئامبىرىغا كىرىش تەلەپ قىلىنىدۇ.";
NSPhotoLibraryAddUsageDescription = "رەسىم ۋە سىنلىرىڭىزنى بۇلۇتقا يوللاش ئۈچۈن رەسىم ئامبىرىغا كىرىش تەلەپ قىلىنىدۇ.";
NSMicrophoneUsageDescription = "ئاۋازلىق خاتىرە ھاسىل قىلىش ئۈچۈن مىكروفون زىيارەت قىلىش تەلەپ قىلىنىدۇ.";
NSLocationWhenInUseUsageDescription = "بۇ ئەپ سىزنىڭ ئورۇن ئۆزگىرىشىڭىزنى بايقاش ھەمدە ئاپتۇماتىك ھۆججەت چىقىرىش ئۈچۈن ئورنىڭىزنى ئىشلىتىدۇ. ئۇ GPS نى ئىشلەتمەيدۇ ھەمدە ئورنىڭىزنى ساقلىمايدۇ.";
NSLocationAlwaysAndWhenInUseUsageDescription = "بۇ ئەپ چوڭراق يۆتكىلىش بايقالغاندا ھۆججەتلەرنى ئارقا سۇپىدىمۇ ئاپتۇماتىك چىقىرىش ئۈچۈن سىزنىڭ ئورنىڭىزنى زىيارەت قىلىشى كېرەك. GPS ئىشلىتىلمەيدۇ.";
